#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.ecs.random_id.target_group_sufix: Refreshing state... [id=m8c]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:909067940010:cluster/staging-ecs-cluster]
module.ecs.aws_iam_role.ecs_autoscale_role: Refreshing state... [id=staging_ecs_autoscale_role]
module.ecs.aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_task_execution_role]
module.ecs.aws_cloudwatch_log_group.rails_terraform: Refreshing state... [id=rails_terraform]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0444adf7b5aeab46a]
module.ecs.aws_ecr_repository.rails_terraform_app: Refreshing state... [id=rails_terraform/production]
module.ecs.aws_iam_role.ecs_role: Refreshing state... [id=ecs_role]
module.ecs.aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_task_execution_role:ecs_execution_role_policy]
module.ecs.aws_iam_role_policy.ecs_autoscale_role_policy: Refreshing state... [id=staging_ecs_autoscale_role:ecs_autoscale_role_policy]
module.ecs.aws_iam_role_policy.ecs_service_role_policy: Refreshing state... [id=ecs_role:ecs_service_role_policy]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0354be60bb1d5ec21]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0204081b45ea3e961]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-063676360172e96a1]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-06601fac6c000dad7]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-039fd6e1b378d2eb7]
module.ecs.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0efb3126c4f50c67c]
module.rds.aws_security_group.db_access_sg: Refreshing state... [id=sg-0c7c9124f3fc680e3]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0e5186daf67a40d60]
module.networking.aws_security_group.default: Refreshing state... [id=sg-02b6fe8023cfecdd7]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0a1e8c33302e0df42]
module.ecs.aws_security_group.web_inbound_sg: Refreshing state... [id=sg-0ca9858e586b96648]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-039fd6e1b378d2eb71080289494]
module.networking.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0c6160c1252acc356]
module.rds.aws_security_group.rds_sg: Refreshing state... [id=sg-051780a7dfdcdfa19]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d5dc53519b4b9dc1]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-019e5049539f3c393]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e9456c49fba8e329]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=staging-rds-subnet-group]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9e65e9092065007]
module.ecs.aws_alb.alb_rails-terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/staging-alb-rails-terraform/6f12e3d5766b8c50]
module.networking.aws_nat_gateway.nat: Refreshing state... [id=nat-03a748be0dd0f1624]
module.networking.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0354be60bb1d5ec211080289494]
module.ecs.aws_alb_listener.rails_terraform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/staging-alb-rails-terraform/6f12e3d5766b8c50/3bfa1a161928c3b4]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ecs.aws_cloudwatch_log_group.rails_terraform has been changed
  ~ resource "aws_cloudwatch_log_group" "rails_terraform" {
        id                = "rails_terraform"
        name              = "rails_terraform"
      ~ tags              = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }
  # module.ecs.aws_iam_role.ecs_execution_role has been changed
  ~ resource "aws_iam_role" "ecs_execution_role" {
        id                    = "ecs_task_execution_role"
        name                  = "ecs_task_execution_role"
      + tags                  = {
          + "Environment" = "staging"
        }
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_execution_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchCheckLayerAvailability",
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:BatchGetImage",
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.ecs.aws_iam_role.ecs_role has been changed
  ~ resource "aws_iam_role" "ecs_role" {
        id                    = "ecs_role"
        name                  = "ecs_role"
      + tags                  = {
          + "Environment" = "staging"
        }
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_service_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                              + "elasticloadbalancing:Describe*",
                              + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                              + "ec2:Describe*",
                              + "ec2:AuthorizeSecurityGroupIngress",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.ecs.aws_security_group.ecs_service has been changed
  ~ resource "aws_security_group" "ecs_service" {
        id                     = "sg-0a1e8c33302e0df42"
        name                   = "staging-ecs-service-sg"
      ~ tags                   = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }
  # module.ecs.aws_alb_target_group.alb_target_group has been changed
  ~ resource "aws_alb_target_group" "alb_target_group" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57"
        name                               = "staging-alb-target-group-9bc7"
      + tags                               = {
          + "Environment" = "staging"
        }
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.ecs.aws_alb.alb_rails-terraform has been changed
  ~ resource "aws_alb" "alb_rails-terraform" {
        id                         = "arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/staging-alb-rails-terraform/6f12e3d5766b8c50"
        name                       = "staging-alb-rails-terraform"
      ~ tags                       = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }
  # module.ecs.aws_ecr_repository.rails_terraform_app has been changed
  ~ resource "aws_ecr_repository" "rails_terraform_app" {
        id                   = "rails_terraform/production"
        name                 = "rails_terraform/production"
      + tags                 = {
          + "Environment" = "staging"
        }
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.ecs.aws_ecs_cluster.cluster has been changed
  ~ resource "aws_ecs_cluster" "cluster" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:us-east-2:909067940010:cluster/staging-ecs-cluster"
        name               = "staging-ecs-cluster"
      + tags               = {
          + "Environment" = "staging"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.ecs.aws_alb_listener.rails_terraform has been changed
  ~ resource "aws_alb_listener" "rails_terraform" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/staging-alb-rails-terraform/6f12e3d5766b8c50/3bfa1a161928c3b4"
      + tags              = {
          + "Environment" = "staging"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.ecs.aws_security_group.web_inbound_sg has been changed
  ~ resource "aws_security_group" "web_inbound_sg" {
        id                     = "sg-0ca9858e586b96648"
        name                   = "staging-web-inbound-sg"
      ~ tags                   = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }
  # module.ecs.aws_iam_role.ecs_autoscale_role has been changed
  ~ resource "aws_iam_role" "ecs_autoscale_role" {
        id                    = "staging_ecs_autoscale_role"
        name                  = "staging_ecs_autoscale_role"
      + tags                  = {
          + "Environment" = "staging"
        }
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "ecs_autoscale_role_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecs:DescribeServices",
                              + "ecs:UpdateService",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "cloudwatch:DescribeAlarms",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.networking.aws_subnet.private_subnet[0] has been changed
  ~ resource "aws_subnet" "private_subnet" {
        id                              = "subnet-0efb3126c4f50c67c"
      ~ tags                            = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }
  # module.networking.aws_subnet.private_subnet[1] has been changed
  ~ resource "aws_subnet" "private_subnet" {
        id                              = "subnet-0e5186daf67a40d60"
      ~ tags                            = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }
  # module.networking.aws_nat_gateway.nat has been changed
  ~ resource "aws_nat_gateway" "nat" {
        id                   = "nat-03a748be0dd0f1624"
      ~ tags                 = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }
  # module.networking.aws_eip.nat_eip has been changed
  ~ resource "aws_eip" "nat_eip" {
      + association_id       = "eipassoc-04ea0045d8451acb8"
        id                   = "eipalloc-0c6160c1252acc356"
      + network_interface    = "eni-08a15cf2e1812e4b5"
      + private_dns          = "ip-10-0-1-84.us-east-2.compute.internal"
      + private_ip           = "10.0.1.84"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }
  # module.networking.aws_route_table.private has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0354be60bb1d5ec21"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-03a748be0dd0f1624"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      ~ tags             = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }
  # module.networking.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
        id                     = "sg-02b6fe8023cfecdd7"
        name                   = "staging-default-sg"
      + tags                   = {
          + "Environment" = "staging"
        }
        # (8 unchanged attributes hidden)
    }
  # module.networking.aws_route_table.public has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-039fd6e1b378d2eb7"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-063676360172e96a1"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      ~ tags             = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }
  # module.networking.aws_internet_gateway.ig has been changed
  ~ resource "aws_internet_gateway" "ig" {
        id       = "igw-063676360172e96a1"
      ~ tags     = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }
  # module.networking.aws_subnet.public_subnet[0] has been changed
  ~ resource "aws_subnet" "public_subnet" {
        id                              = "subnet-0204081b45ea3e961"
      ~ tags                            = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }
  # module.networking.aws_subnet.public_subnet[1] has been changed
  ~ resource "aws_subnet" "public_subnet" {
        id                              = "subnet-06601fac6c000dad7"
      ~ tags                            = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }
  # module.networking.aws_vpc.vpc has been changed
  ~ resource "aws_vpc" "vpc" {
        id                               = "vpc-0444adf7b5aeab46a"
      ~ tags                             = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (13 unchanged attributes hidden)
    }
  # module.rds.aws_db_subnet_group.rds_subnet_group has been changed
  ~ resource "aws_db_subnet_group" "rds_subnet_group" {
        id          = "staging-rds-subnet-group"
        name        = "staging-rds-subnet-group"
      + tags        = {
          + "Environment" = "staging"
        }
        # (4 unchanged attributes hidden)
    }
  # module.rds.aws_security_group.db_access_sg has been changed
  ~ resource "aws_security_group" "db_access_sg" {
        id                     = "sg-0c7c9124f3fc680e3"
        name                   = "staging-db-access-sg"
      ~ tags                   = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }
  # module.rds.aws_security_group.rds_sg has been changed
  ~ resource "aws_security_group" "rds_sg" {
        id                     = "sg-051780a7dfdcdfa19"
        name                   = "staging-rds-sg"
      ~ tags                   = {
          + "Environment" = "staging"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.aws_ecs_task_definition.web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "web"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "dev_web"
      + task_role_arn   = (known after apply)
    }

  # module.ecs.data.template_file.db_migrate_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "db_migrate_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + command          = [
                      + "bundle",
                      + "exec",
                      + "rake",
                      + "db:migrate",
                    ]
                  + environment      = [
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_URL"
                          + value = "${database_url}"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "${secret_key_base}"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group}"
                          + awslogs-region        = "${region}"
                          + awslogs-stream-prefix = "db_migrate"
                        }
                    }
                  + memory           = 300
                  + name             = "db-migrate"
                },
            ]
        )
      + vars     = {
          + "database_url"    = (known after apply)
          + "image"           = "909067940010.dkr.ecr.us-east-2.amazonaws.com/rails_terraform/production"
          + "log_group"       = "rails_terraform"
          + "secret_key_base" = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
        }
    }

  # module.ecs.data.template_file.web_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "web_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "RAILS_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_URL"
                          + value = "${database_url}"
                        },
                      + {
                          + name  = "SECRET_KEY_BASE"
                          + value = "${secret_key_base}"
                        },
                      + {
                          + name  = "PORT"
                          + value = "80"
                        },
                      + {
                          + name  = "RAILS_LOG_TO_STDOUT"
                          + value = "true"
                        },
                      + {
                          + name  = "RAILS_SERVE_STATIC_FILES"
                          + value = "true"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group}"
                          + awslogs-region        = "${region}"
                          + awslogs-stream-prefix = "web"
                        }
                    }
                  + memory           = 300
                  + name             = "web"
                  + networkMode      = "awsvpc"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "database_url"    = (known after apply)
          + "image"           = "909067940010.dkr.ecr.us-east-2.amazonaws.com/rails_terraform/production"
          + "log_group"       = "rails_terraform"
          + "secret_key_base" = "8d412aee3ceaa494fe1c276f5f7e524b9e33f649c03690e689e5b36a0cf4ce2a6f50024bc31f276c22b668e619d61a42b79f5e595759f377a8fa373e2907f41e"
        }
    }

  # module.ecs.aws_alb.alb_rails-terraform must be replaced
-/+ resource "aws_alb" "alb_rails-terraform" {
      ~ arn                        = "arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/staging-alb-rails-terraform/6f12e3d5766b8c50" -> (known after apply)
      ~ arn_suffix                 = "app/staging-alb-rails-terraform/6f12e3d5766b8c50" -> (known after apply)
      ~ dns_name                   = "staging-alb-rails-terraform-401225168.us-east-2.elb.amazonaws.com" -> (known after apply)
      ~ id                         = "arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/staging-alb-rails-terraform/6f12e3d5766b8c50" -> (known after apply)
      ~ internal                   = false -> (known after apply)
      ~ ip_address_type            = "ipv4" -> (known after apply)
      ~ name                       = "staging-alb-rails-terraform" -> "dev-alb-rails-terraform" # forces replacement
      ~ security_groups            = [
          - "sg-02b6fe8023cfecdd7",
          - "sg-0c7c9124f3fc680e3",
          - "sg-0ca9858e586b96648",
        ] -> (known after apply)
      ~ tags                       = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-alb-rails_terraform" -> "dev-alb-rails_terraform"
        }
      ~ tags_all                   = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-alb-rails_terraform" -> "dev-alb-rails_terraform"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                     = "vpc-0444adf7b5aeab46a" -> (known after apply)
      ~ zone_id                    = "Z3AADJGX6KTTL2" -> (known after apply)
        # (6 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0204081b45ea3e961" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-06601fac6c000dad7" -> null
        }
      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.ecs.aws_alb_listener.rails_terraform must be replaced
-/+ resource "aws_alb_listener" "rails_terraform" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/staging-alb-rails-terraform/6f12e3d5766b8c50/3bfa1a161928c3b4" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-2:909067940010:listener/app/staging-alb-rails-terraform/6f12e3d5766b8c50/3bfa1a161928c3b4" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:909067940010:loadbalancer/app/staging-alb-rails-terraform/6f12e3d5766b8c50" -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all          = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_alb_target_group.alb_target_group must be replaced
+/- resource "aws_alb_target_group" "alb_target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:909067940010:targetgroup/staging-alb-target-group-9bc7/4fe2419ab52f5f57" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "staging-alb-target-group-9bc7" -> "dev-alb-target-group-9bc7" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all                           = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # module.ecs.aws_appautoscaling_policy.down will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.up will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "dev_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.target will be created
  + resource "aws_appautoscaling_target" "target" {
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/dev-ecs-cluster/dev-web"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_cloudwatch_log_group.rails_terraform will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "rails_terraform" {
        id                = "rails_terraform"
        name              = "rails_terraform"
      ~ tags              = {
          - "Environment" = "staging" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all          = {
          ~ "Environment" = "staging" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "dev_rails_terraform_web_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "dev-ecs-cluster"
          + "ServiceName" = "dev-web"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.ecs.aws_ecr_repository.rails_terraform_app will be updated in-place
  ~ resource "aws_ecr_repository" "rails_terraform_app" {
        id                   = "rails_terraform/production"
        name                 = "rails_terraform/production"
      ~ tags                 = {
          - "Environment" = "staging" -> null
        }
      ~ tags_all             = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_cluster.cluster must be replaced
-/+ resource "aws_ecs_cluster" "cluster" {
      ~ arn                = "arn:aws:ecs:us-east-2:909067940010:cluster/staging-ecs-cluster" -> (known after apply)
      - capacity_providers = [] -> null
      ~ id                 = "arn:aws:ecs:us-east-2:909067940010:cluster/staging-ecs-cluster" -> (known after apply)
      ~ name               = "staging-ecs-cluster" -> "dev-ecs-cluster" # forces replacement
      - tags               = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all           = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.web will be created
  + resource "aws_ecs_service" "web" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-web"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "web"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0e5186daf67a40d60",
              + "subnet-0efb3126c4f50c67c",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.db_migrate will be created
  + resource "aws_ecs_task_definition" "db_migrate" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_db_migrate"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

  # module.ecs.aws_ecs_task_definition.web will be created
  + resource "aws_ecs_task_definition" "web" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
      + family                   = "dev_web"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + task_role_arn            = "arn:aws:iam::909067940010:role/ecs_task_execution_role"
    }

  # module.ecs.aws_iam_role.ecs_autoscale_role must be replaced
-/+ resource "aws_iam_role" "ecs_autoscale_role" {
      ~ arn                   = "arn:aws:iam::909067940010:role/staging_ecs_autoscale_role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "application-autoscaling.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-08-09T18:44:17Z" -> (known after apply)
      ~ id                    = "staging_ecs_autoscale_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "staging_ecs_autoscale_role" -> "dev_ecs_autoscale_role" # forces replacement
      - tags                  = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all              = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
      ~ unique_id             = "AROA5HKFL6CVNGI236QLA" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "ecs_autoscale_role_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ecs:DescribeServices",
                              - "ecs:UpdateService",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "*",
                            ]
                        },
                      - {
                          - Action   = [
                              - "cloudwatch:DescribeAlarms",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role.ecs_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_execution_role" {
        id                    = "ecs_task_execution_role"
        name                  = "ecs_task_execution_role"
      ~ tags                  = {
          - "Environment" = "staging" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_role.ecs_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_role" {
        id                    = "ecs_role"
        name                  = "ecs_role"
      ~ tags                  = {
          - "Environment" = "staging" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_role_policy.ecs_autoscale_role_policy must be replaced
-/+ resource "aws_iam_role_policy" "ecs_autoscale_role_policy" {
      ~ id     = "staging_ecs_autoscale_role:ecs_autoscale_role_policy" -> (known after apply)
        name   = "ecs_autoscale_role_policy"
      ~ role   = "staging_ecs_autoscale_role" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_security_group.ecs_service must be replaced
-/+ resource "aws_security_group" "ecs_service" {
      ~ arn                    = "arn:aws:ec2:us-east-2:909067940010:security-group/sg-0a1e8c33302e0df42" -> (known after apply)
      ~ id                     = "sg-0a1e8c33302e0df42" -> (known after apply)
      ~ name                   = "staging-ecs-service-sg" -> "dev-ecs-service-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "909067940010" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-ecs-service-sg" -> "dev-ecs-service-sg"
        }
      ~ tags_all               = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-ecs-service-sg" -> "dev-ecs-service-sg"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.web_inbound_sg must be replaced
-/+ resource "aws_security_group" "web_inbound_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-2:909067940010:security-group/sg-0ca9858e586b96648" -> (known after apply)
      ~ id                     = "sg-0ca9858e586b96648" -> (known after apply)
      ~ name                   = "staging-web-inbound-sg" -> "dev-web-inbound-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "909067940010" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-web-inbound-sg" -> "dev-web-inbound-sg"
        }
      ~ tags_all               = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-web-inbound-sg" -> "dev-web-inbound-sg"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.networking.aws_eip.nat_eip will be updated in-place
  ~ resource "aws_eip" "nat_eip" {
        id                   = "eipalloc-0c6160c1252acc356"
        tags                 = {}
      ~ tags_all             = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
        # (10 unchanged attributes hidden)
    }

  # module.networking.aws_internet_gateway.ig will be updated in-place
  ~ resource "aws_internet_gateway" "ig" {
        id       = "igw-063676360172e96a1"
      ~ tags     = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-igw" -> "dev-igw"
        }
      ~ tags_all = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-igw" -> "dev-igw"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.aws_nat_gateway.nat will be updated in-place
  ~ resource "aws_nat_gateway" "nat" {
        id                   = "nat-03a748be0dd0f1624"
      ~ tags                 = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-us-east-2b-nat" -> "dev-us-east-2b-nat"
        }
      ~ tags_all             = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-us-east-2b-nat" -> "dev-us-east-2b-nat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.networking.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0354be60bb1d5ec21"
      ~ tags             = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-private-route-table" -> "dev-private-route-table"
        }
      ~ tags_all         = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-private-route-table" -> "dev-private-route-table"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.networking.aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-039fd6e1b378d2eb7"
      ~ tags             = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-public-route-table" -> "dev-public-route-table"
        }
      ~ tags_all         = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-public-route-table" -> "dev-public-route-table"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.networking.aws_security_group.default must be replaced
-/+ resource "aws_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:us-east-2:909067940010:security-group/sg-02b6fe8023cfecdd7" -> (known after apply)
      ~ id                     = "sg-02b6fe8023cfecdd7" -> (known after apply)
      ~ name                   = "staging-default-sg" -> "dev-default-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "909067940010" -> (known after apply)
      - tags                   = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all               = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.networking.aws_subnet.private_subnet[0] will be updated in-place
  ~ resource "aws_subnet" "private_subnet" {
        id                              = "subnet-0efb3126c4f50c67c"
      ~ tags                            = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-us-east-2a-private-subnet" -> "dev-us-east-2a-private-subnet"
        }
      ~ tags_all                        = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-us-east-2a-private-subnet" -> "dev-us-east-2a-private-subnet"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.aws_subnet.private_subnet[1] will be updated in-place
  ~ resource "aws_subnet" "private_subnet" {
        id                              = "subnet-0e5186daf67a40d60"
      ~ tags                            = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-us-east-2b-private-subnet" -> "dev-us-east-2b-private-subnet"
        }
      ~ tags_all                        = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-us-east-2b-private-subnet" -> "dev-us-east-2b-private-subnet"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.aws_subnet.public_subnet[0] will be updated in-place
  ~ resource "aws_subnet" "public_subnet" {
        id                              = "subnet-0204081b45ea3e961"
      ~ tags                            = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-us-east-2a-public-subnet" -> "dev-us-east-2a-public-subnet"
        }
      ~ tags_all                        = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-us-east-2a-public-subnet" -> "dev-us-east-2a-public-subnet"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.aws_subnet.public_subnet[1] will be updated in-place
  ~ resource "aws_subnet" "public_subnet" {
        id                              = "subnet-06601fac6c000dad7"
      ~ tags                            = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-us-east-2b-public-subnet" -> "dev-us-east-2b-public-subnet"
        }
      ~ tags_all                        = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-us-east-2b-public-subnet" -> "dev-us-east-2b-public-subnet"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                               = "vpc-0444adf7b5aeab46a"
      ~ tags                             = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-vpc" -> "dev-vpc"
        }
      ~ tags_all                         = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-vpc" -> "dev-vpc"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.rds.aws_db_instance.rds will be created
  + resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "9.6.6"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dev-database"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "railsterraform_dev"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "dev"
          + "Owner"       = "Ops"
          + "Project"     = "ecs_rds_rails_tf"
        }
      + timezone                              = (known after apply)
      + username                              = "railsterraform"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_subnet_group.rds_subnet_group must be replaced
-/+ resource "aws_db_subnet_group" "rds_subnet_group" {
      ~ arn         = "arn:aws:rds:us-east-2:909067940010:subgrp:staging-rds-subnet-group" -> (known after apply)
      ~ id          = "staging-rds-subnet-group" -> (known after apply)
      ~ name        = "staging-rds-subnet-group" -> "dev-rds-subnet-group" # forces replacement
      + name_prefix = (known after apply)
      - tags        = {
          - "Environment" = "staging"
        } -> null
      ~ tags_all    = {
          ~ "Environment" = "staging" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.db_access_sg must be replaced
-/+ resource "aws_security_group" "db_access_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-2:909067940010:security-group/sg-0c7c9124f3fc680e3" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0c7c9124f3fc680e3" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "staging-db-access-sg" -> "dev-db-access-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "909067940010" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-db-access-sg" -> "dev-db-access-sg"
        }
      ~ tags_all               = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-db-access-sg" -> "dev-db-access-sg"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.rds_sg must be replaced
-/+ resource "aws_security_group" "rds_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-2:909067940010:security-group/sg-051780a7dfdcdfa19" -> (known after apply)
      ~ description            = "staging Security Group" -> "dev Security Group" # forces replacement
      ~ id                     = "sg-051780a7dfdcdfa19" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0c7c9124f3fc680e3",
                ]
              - self             = false
              - to_port          = 5432
            },
            # (2 unchanged elements hidden)
        ]
      ~ name                   = "staging-rds-sg" -> "dev-rds-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "909067940010" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "staging-rds-sg" -> "dev-rds-sg"
        }
      ~ tags_all               = {
          ~ "Environment" = "staging" -> "dev"
          ~ "Name"        = "staging-rds-sg" -> "dev-rds-sg"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

Plan: 20 to add, 14 to change, 12 to destroy.

Changes to Outputs:
  ~ alb_dns_name = "staging-alb-rails-terraform-401225168.us-east-2.elb.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @bsneider, Action: `pull_request`*